{
  "NAVBAR": {
    "HOME": "Start",
    "PUBLICATIONS": "Publikationen",
    "PROJECTS": "Projekte",
    "CV": "Lebenslauf",
    "CONTACT": "Kontakt"
  },
  "ABOUT": {
    "PICTURE_ALT": "Bild des Webseiten Entwicklers (Maximilian Hagn)",
    "HELLO": "Hallo Welt",
    "MAX": "Ich heiße Max",
    "SHORT_DESC": "Ich studieren und arbeite im Bereich der Computerwissenschaften und der Betriebswirtschaftslehre.",
    "LONG_DESC": "Im Jahr 2014 begann ich, mich mit Informatik zu beschäftigen, indem ich auf ein technisches Gymnasium wechselte. Nach dem Abschluss dieser fünfjährigen Einrichtung verfügte ich bereits über ein fundiertes Wissen in diesem Bereich und wechselte daher an eine technische Universität, um zunächst Wirtschaftsinformatik und später zusätzlich Software- und Informationstechnik zu studieren. Neben mehreren Praktika in diesem Bereich habe ich drei Jahre lang für ein Computerunternehmen gearbeitet, in dem ich für den technischen Support und die Webentwicklung zuständig war. Danach arbeitete ich bei einer Unternehmensberatung, für die ich an der Entwicklung einer Forderungsmanagement-Software beteiligt war. Außerdem war ich als studentischer wissenschaftlicher Mitarbeiter an der Technischen Universität für meine Bachelorarbeit angestellt, für die ich eine Terminal-Benutzeroberfläche schrieb, die Verstöße gegen MPI-Richtlinien erkennt."
  },
  "PROJECTS": {
    "HEADING": "Projekte",
    "INTRO_TEXT": "In diesem Abschnitt finden Sie meine bisherigen Softwareentwicklungsprojekte. Diese Projekte sind entweder Aufgaben, die ich in der Schule oder an der Universität erledigen musste, oder private Projekte. Bei den meisten Projekten kann der Quellcode über GitHub eingesehen und weiterverwendet werden. Wenn Projekte noch aktiv auf meinem Server gehostet werden, ist auch die Website des Projekts aufgeführt. Im Folgenden sehen Sie eine Auswahl meiner besten Projekte, über das Dropdown-Menü kann aber auch ein anderes Schlagwort ausgewählt werden.",
    "WEBSITE": "Webseite erkunden",
    "SOURCE": "Quellcode durchsuchen",
    "TOOLTIP_SEARCH": "Nach Schlagwort suchen"
  },
  "PUBLICATIONS": {
    "HEADING": "Publikationen",
    "INTRO_TEXT": "In meiner schulischen und akademischen Laufbahn durfte ich bereits einige vorwissenschaftliche und wissenschaftliche Arbeiten schreiben, mit denen ich mein Wissen im Bereich der Informatik vertiefen konnte. Meine letzte Arbeit habe ich im Winter 2021 geschrieben. Im Rahmen meiner Bachelorarbeit habe ich eine Anwendung entwickelt, die den abstrakten Syntaxbaum von Clang und LLVM nutzt, um C++-Programme zu analysieren und automatisch Leistungszähler an den kritischen Stellen einzufügen. Meine erste vorwissenschaftliche Arbeit habe ich im Rahmen meiner Diplomarbeit entwickelt, eine Arbeit, die in Österreich zur Erlangung des Titels eines Ingenieurs erforderlich ist. In dieser Arbeit haben wir in einem 5-köpfigen Team eine E-Learning Plattform entwickelt, die auf einem selbst entwickelten didaktischen Konzept basiert. Diese Plattform soll jungen Entwicklern helfen, schneller in die Welt der Webentwicklung einzutauchen. Darüber hinaus haben wir viele weitere Inhalte entwickelt, wie zum Beispiel die Erstellung eines eigenen CSS-Frameworks, das sich an den etablierten Frameworks \"Bootstrap\" und \" Tailwind\" orientiert. Weitere Ziele des Projekts waren ein effizientes Projektmanagement, sowie die Erstellung eines Marketingkonzepts und einer eigenen Marke. Nachfolgend finden Sie die Zusammenfassungen der Arbeiten und Links zu den Webseiten sowie den Quellcode.",
    "BACHELOR": "Bachelorarbeit",
    "MASTER": "Masterarbeit",
    "DIPLOMA": "Diplomarbeit",
    "UNIVERSITY": "Technische Universität Wien",
    "SCHOOL": "Höhere Technische Lehranstalt Rennweg",
    "BOOK": "Buch herunterladen",
    "WEBSITE": "Webseite erkunden",
    "SOURCE": "Quellcode durchsuchen",
    "WEBSITE_INFO": "Information's Webseite",
    "WEBSITE_FRAMEWORK": "CSS Framework",
    "WEBSITE_E_LEARNING": "E-Learning Plattform",
    "BACHELOR_1_TITLE": "Erkennen von Leistungsengpässen mittels AST-Transformationen",
    "BACHELOR_1_TEXT_1": "Bei der Entwicklung von Software stehen viele Programmiererinnen und Programmierer früher oder später vor der Frage, wie sie ihre Anwendungen optimieren und damit auch die Laufzeit so kurz wie möglich halten können. Gerade im Bereich des Hochleistungsrechnens und bei der Entwicklung zeitkritischer Software ist die Verkürzung der Laufzeit von Programmen unabdingbar. Die Laufzeitanalyse ist daher eine grundlegende Technik, die jede Entwicklerin und jeder Entwickler beherrschen muss. Zu diesem Zweck wird der Quellcode entweder manuell überprüft oder die Anwendung während der Laufzeit mit Profiling-Tools analysiert. Diese Instrumente bieten den Benutzenden die Möglichkeit, Daten über die Leistung einzelner Funktionen zu erhalten. Bei den meisten Tools können die <em>interessierenden Bereiche (ROI)</em> in der Regel manuell festgelegt werden. Die Identifizierung dieser Bereiche kann problematisch sein, insbesondere bei der Entwicklung komplexer Programme. Daher wäre es wünschenswert, wenn es eine Methode gäbe, mit der benutzerdefinierte <em>Bereiche von Interesse</em> durch automatisches Einfügen von Messcode analysiert werden könnten.",
    "BACHELOR_1_TEXT_2": "In dieser Arbeit wird ein Werkzeug zur Leistungsmessung vorgestellt, das zur automatischen Messung der Laufzeiten kritischer Bereiche in <em>C</em> / <em>C++</em> Anwendungen verwendet werden kann. Das entwickelte Werkzeug basiert auf dem von <em>Clang</em> bereitgestellten Framework, das verschiedene Funktionen zum Traversieren von <em>abstrakten Syntaxbäumen} (AST)</em> bietet. Das Werkzeug analysiert den von <em>Clang</em> bereitgestellten <em>Syntaxbaum</em> des Eingabecodes und fügt automatisch Messcode an den gewünschten Stellen ein. Dazu wird der <em>abstrakte Syntaxbaum</em> von der Wurzel abwärts durchlaufen, wobei in jeder Iteration eine hierarchisch niedrigere Ebene von der Benutzerin oder dem Benutzer ausgewählt werden kann. In jeder Iteration erhält die oder der Anwendende Statistiken über die <em>interessierenden Bereiche</em> und kann selbst auf Basis der gewonnenen Informationen entscheiden, welcher Bereich als nächster analysiert werden soll. Um die Funktionalität des Programms vorzustellen werden wir den Arbeitsablauf an verschiedenen Beispielen demonstrieren. Des Weiteren wird anhand einer Überlaufanalyse gezeigt, dass der Überlauf des Profiling-Prozesses durch die iterative Vorgehensweise gering gehalten werden~kann.",
    "DIPLOMA_TITLE": "Creative Puzzle - Web Development E-Learning Plattform",
    "DIPLOMA_TEXT_1": "<em>Creative Puzzle</em> möchte Menschen mit wenig Vorwissen für das Schreiben von Webseiten begeistern und mithilfe von spielerischen Übungen, vorgefertigten Lern-Templates und einer Code-Bibliothek eine Hilfestellung anbieten. Durch ‚Learning By Doing‘ haben die Lernenden die Möglichkeit, sich schnell in verschiedene Programmiersprachen einzuarbeiten. Eine E-Learning Plattform speziell für die 1. bis 3. Klassen an Höheren Technischen Lehranstalten soll erstellt werden. Meistens ist es für Schüler der unteren Schulstufen schwer, den Zusammenhang einzelner Komponenten einer Dokumentation zu erkennen und sie kommen deswegen nur schwer mit den zahlreichen verschiedenen Kommandos zurecht. <em>Creative Puzzle</em> möchte das endlose Stöbern in Spezifikationen erleichtern, indem praxisbezogene Übungsbeispiele bereitgestellt werden. Es kann sich dabei um vorgefertigte Templates oder spielerische Übungen handeln. Im Gegensatz zu bestehenden spezifizierten Informationswebseiten werden die Befehle nicht einzeln erläutert, sondern Webkomponenten Schritt für Schritt erklärt und somit praxisbezogen dargestellt. So kann der Zusammenhang einfacher hergestellt werden.",
    "DIPLOMA_TEXT_2": "<em>Creative Puzzle</em> stellt ein schlankes und einfach gehaltenes Framework mit vielen vorgefertigten Templates auf der Webseite zur Verfügung. Diese beinhaltet auch grafische Elemente um die Web-Programmierung spielerisch zu erlernen. Da das Team aus eigener Erfahrung in den ersten HTL-Jahren wenig Motivation für die Gestaltung von Webseiten aufbringen konnte, ist eines der Ziele, mit einem grafisch ansprechenden Design die Aktualität dieser Techniken aufzuzeigen. Zusätzlich hat sich das Team intensiv mit einigen anderen, für Web-Development relevanten, Bereichen beschäftigt. Zum einen wurden Konzepte für effizientes Hosting einer Webseite gestaltet, zum anderen möchte <em>Creative Puzzle</em> seine Seite nach den Search Engine Optimization Richtlinien optimieren.\nEin weiteres Ziel wird es sein, junge Leute für die Webprogrammierung zu begeistern. Das Projektteam befasst sich hauptsächlich mit dem Layouten und Designen von Webseiten-Elementen und der Auseinandersetzung mit der Spezifikation.\nDes Weiteren wird das Team Erkenntnisse und Probleme die es erfahren musste, vorstellen und Tipps geben, die auf der einen Seite für das Schreiben eines Frameworks und auf der anderen Seite für das Layouten einer Webseite relevant sind.\nEin zusätzliches Ziel ist es, für das Projekt zu werben und durch neuartige und komplexe Designs der Werbematerialien, wie Plakate, Flyer, Folder, Visitenkarten und Titelbilder, Aufmerksamkeit auf das Ergebnis zu lenken."
  },
  "CV": {
    "HEADING": "Lebenslauf",
    "TOOLTIP_MAIL": "E-Mail verfassen",
    "TOOLTIP_PHONE": "Telefonnummer anfragen",
    "TOOLTIP_ADDRESS": "Adresse anfragen",
    "ACADEMIC": "Akademischer Lebenslauf Englisch",
    "DETAILED": "Detaillierter Lebenslauf Deutsch",
    "PERSONAL": "Personelle Daten",
    "EDUCATION": "Ausbildung",
    "EMPLOYMENT": "Berufserfahrung",
    "RECOGNITIONS": "Anerkennungen und Auszeichnungen",
    "LANGUAGES": "Sprachen",
    "SKILLS_HEADING": "Kenntnisse",
    "TELEPHONE": "Telefonnummer anfragen",
    "ADDRESS": "Adresse anfragen",
    "BIRTHDAY": "Geburtstag: 25. August 1997",
    "BIRTHPLACE": "Geburtsort: Dresden, Deutschland",
    "CITIZENSHIP": "Staatsbürgerschaft: Deutsch",
    "RESIDENCE": "Wohnort: Wien, Österreich",
    "UNIVERSITY": "Technische Universität Wien",
    "BUSINESS_INFORMATICS": "Studienrichtung Wirtschaftsinformatik",
    "SOFTWARE_ENGINEERING": "Studienrichtung Software & Information Engineering",
    "SCHOOL": "Höhere Technische Lehranstalt Rennweg, 1030 Wien",
    "MEDIA_TECHNOLOGY": "Schwerpunkt Medientechnik",
    "MIDDLE_SCHOOL": "Gymnasium St. Ursula, 1230 Wien",
    "ELEMENTARY_SCHOOL": "Volksschule Maurer Lange Gasse, 1230 Wien",
    "PRESENT": "Folgende",
    "AQILO_DESC": "Technischer Mitarbeiter, Teilzeit (20 Wochenstunden)",
    "AVALON_DESC_PT": "Softwareentwickler, Teilzeit (11 Wochenstunden)",
    "AVALON": "Avalon Computersystem GmbH",
    "SGEF_DESC_FP": "Buchhalter, Ferial-Praktikum (38.5 Wochenstunden)",
    "SGEF_DESC_NJ": "Buchhalter, Teilzeit (10 Wochenstunden)",
    "STIWA_DESC": "Softwareentwickler, Ferial-Praktikum (38.5 Wochenstunden)",
    "AVALON_DESC_FP": "Softwareentwickler, Ferial-Praktikum (38.5 Wochenstunden)",
    "LEADER_DIPLOMA": "Projektleiter der Diplomarbeit \"Creative Puzzle - Web Development E-Learning Platform\" (Benotung: Sehr Gut)",
    "PROJECT_CERTIFICATION": "IPMA - Projektmanagement Zertifizierung (jZpm)",
    "TEAM_BUILDING": "Kommunikation und Teambildung Seminar (34 Stunden)",
    "SIECAMS_LEADER": "Projektleiter eines informationstechnologischen Projektes (Produktflyer für den Service \"Siecams\" von Siemens AG) im Rahmen des Projektmanagement Unterrichts",
    "BSC_1": "Verleihung des akademischen Grades BSc (Erkennen von Leistungsengpässen mittels AST-Transformationen)",
    "HEAD_BOY": "Stellvertretender Abteilungssprecher und 3. im SGA (3. StV. Schulsprecher)",
    "LEADER_PROJECT": "Projektleiter eines informationstechnologischen Projektes im Rahmen des Projektmanagement Unterrichts",
    "HIGH_SCHOOL_REP": "Oberstufen Klassensprecher",
    "GERMAN": "Deutsch (Muttersprache)",
    "ENGLISH": "Englisch (Erste lebende Fremdsprache)"
  },
  "SKILLS": {
    "WORD_PROCESSORS": "Textverarbeitungsprogramme (Microsoft Word, Pages, Google Docs, LibreOffice Writer)",
    "SPREADSHEET": "Tabellenkalkulationsprogramme (Microsoft Excel, Numbers, Google Tabellen, LibreOffice Calc)",
    "PRESENTATION": "Präsentationsprogramme (Microsoft PowerPoint, Keynote)",
    "E_MAIL_PROGRAMS": "E-Mail Programme (Microsoft Outlook, Thunderbird)",
    "OPERATING_SYSTEMS": "Betriebssysteme (Linux, macOS, Windows)",
    "FRONT_END_DEVELOPMENT": "Webseiten-Design (HTML, CSS)",
    "BACK_END_DEVELOPMENT": "Webseiten-Funktionen (PHP / Laravel, JAVA / Spring Boot, C# / Blazor, Typescript / Angular, JavaScript)",
    "GENERAL_PURPOSE": "General Purpose Languages (C, C++, Perl, Java)",
    "APPLE_APPS": "Apple Applikationen (Xcode 9.0, Swift)",
    "NETWORK_ENGINEERING": "Netzwerktechnik",
    "NATIVE_APPS": "Native Applikationen (Cordova, Electron)",
    "COMPILERS": "Übersetzerbau (Lex / Flex, YACC / Bison, Ox, Burg / iBurg, LLVM, Clang)",
    "PROJECT_MANAGEMENT": "Projektmanagement (Lineare Modelle, Agile Methoden, IPMA)",
    "ORGANIZATIONAL": "Organisationstalent",
    "RESPONSIBILITY": "Verantwortungsbewusst",
    "TEAM_SPIRIT": "Teamfähigkeit",
    "COMMUNICATION": "Kommunikationsfähigkeit",
    "DETERMINATION": "Zielstrebigkeit",
    "LICENSES": "B und AM Führerschein, Motorboot Führerschein"
  },
  "CONTACT": {
    "HEADING": "Kontakt",
    "INTRO_TEXT": "Sie können mir gerne eine E-Mail schicken, wenn Sie Fragen zu mir oder meinen Projekten haben. Ich bin aber auch immer an freiberuflichen Angeboten interessiert.",
    "TOOLTIP_MAIL": "E-Mail verfassen",
    "TOOLTIP_PHONE": "Telefonnummer anfragen"
  }
}
