[
  {
    "title": "UpToDate",
    "description_en": "<em>UpToDate</em> is a web application I developed for myself to manage my appointments, notes and lists. The application includes a calendar, a program to create notes, a function to manage contacts, a tool to create lists and a tracker to record habits or routines. All these functions help me to organize my thoughts and keep them in one place. I had the idea to develop this application because many applications simply had too many functions and could not be used on all operating systems. Furthermore, by developing my own REST API, I now have the possibility to use it in other applications and most importantly, all the functions can also be integrated into my smarthome, for example, I can display my appointments on the TVs. I use the application almost every day to enter my appointments, organize my ideas and to keep track of my tasks. Furthermore, I am constantly developing this application to fix bugs, add more features or to adapt the usability to my habits. The REST API of the application is written with the backend framework Spring Boot based on the Java programming language, whereas the frontend utilizes the functions of the framework Angular developed by Google.",
    "description_de": "<em>UpToDate</em> ist eine Webanwendung, die ich für mich selbst entwickelt habe, um meine Termine, Notizen und Listen zu verwalten. Die Anwendung umfasst einen Kalender, ein Programm zum Erstellen von Notizen, eine Funktion zur Verwaltung von Kontakten, ein Werkzeug zum Erstellen von Listen und einen Tracker zum Aufzeichnen von Gewohnheiten oder Routinen. All diese Funktionen helfen mir, meine Gedanken zu ordnen und sie an einem Ort zu halten. Ich hatte die Idee, diese Anwendung zu entwickeln, weil viele Anwendungen einfach zu viele Funktionen hatten und nicht auf allen Betriebssystemen genutzt werden konnten. Außerdem habe ich durch die Entwicklung einer eigenen REST-API nun die Möglichkeit, sie in anderen Anwendungen zu nutzen und vor allem können alle Funktionen auch in mein Smarthome integriert werden, so dass ich zum Beispiel meine Termine auf den Fernsehern anzeigen lassen kann. Ich nutze die Anwendung fast täglich, um meine Termine einzutragen, meine Ideen zu organisieren und um den Überblick über meine Aufgaben zu behalten. Außerdem entwickle ich diese Anwendung ständig weiter, um Fehler zu beheben, weitere Funktionen hinzuzufügen oder die Benutzerfreundlichkeit an meine Gewohnheiten anzupassen. Die REST-API der Anwendung ist mit dem auf der Programmiersprache Java basierenden Backend-Framework Spring Boot geschrieben, während das Frontend die Funktionen des von Google entwickelten Frameworks Angular nutzt. ",
    "date": "2022",
    "keywords": [
      {
        "tag": "Java Spring Boot API"
      },
      {
        "tag": "Angular 13"
      },
      {
        "tag": "Website"
      },
      {
        "tag": "Top"
      }
    ],
    "website": "https://uptodate.hagn.network",
    "github": "https://github.com/maxhagn/UpToDate"
  },
  {
    "title": "Maximilian Hagn Portfolio Website",
    "description_en": "This project contains my current portfolio website, the page you are currently viewing. The goal of the project is to represent myself on the internet. Furthermore I am practicing design and content creation on this website. The website is built as a simple single-page website that presents the most important facts about me, my resume and my skills. The website was developed with the framework Angular from Google.",
    "description_de": "Dieses Projekt enthält meine aktuelle Portfolio-Website, die Seite, die Sie gerade sehen. Das Ziel des Projekts ist es, mich im Internet zu präsentieren. Außerdem übe ich mich auf dieser Website in Design und Content-Erstellung. Die Website ist als einfache Single-Page-Website aufgebaut, die die wichtigsten Fakten über mich, meinen Lebenslauf und meine Fähigkeiten präsentiert. Die Website wurde mit dem Framework Angular von Google entwickelt.",
    "date": "2022",
    "keywords": [
      {
        "tag": "Angular 13"
      },
      {
        "tag": "Website"
      },
      {
        "tag": "Top"
      }
    ],
    "website": "https://maximilian.hagn.network",
    "github": "https://github.com/maxhagn/MaximilianHagnPortfolio"
  },
  {
    "title": "Marlene Stanzl Portfolio Website",
    "description_en": "This repository contains the website of Marlene Stanzl which was written with the frontend framework Angular.",
    "description_de": "This repository contains the website of Marlene Stanzl which was written with the frontend framework Angular.",
    "date": "2022",
    "keywords": [
      {
        "tag": "Angular 13"
      },
      {
        "tag": "Website"
      }
    ],
    "website": "https://marlene.hagn.network",
    "github": "https://github.com/maxhagn/MarleneStanzlPortfolio"
  },
  {
    "title": "Compiler Construction C",
    "description_en": "This project contains my first self-written programming language. This was a task I had to accomplish in the course of the compiler development course at the Vienna University of Technology. The main goal was to develop a compiler from a given grammar and to implement all necessary stages of a compiler. The lexical analysis was written with the tool Flex. Based on this, YACC was used to parse the input. Furthermore, the tool OX was used so that an attributed grammar can be created. The optimization and code generation was done with the help of iBurg, which finally allowed AMD Assembler 64 code to be generated from the input. The end result is a program - a compiler - that can read programs and translate them into assembly code.",
    "description_de": "Dieses Projekt enthält meine erste selbstgeschriebene Programmiersprache. Dies war eine Aufgabe, die ich im Rahmen des Übersetzerbau Kurses an der Technischen Universität Wien zu lösen hatte. Das Hauptziel war es, einen Compiler aus einer vorgegebenen Grammatik zu entwickeln und alle notwendigen Phasen eines Compilers zu implementieren. Die lexikalische Analyse wurde mit dem Tool Flex geschrieben. Darauf aufbauend wurde YACC zum Parsen der Eingabe verwendet. Außerdem wurde das Werkzeug OX verwendet, um eine attributierte Grammatik zu erstellen. Die Optimierung und Codegenerierung erfolgte mit Hilfe von iBurg, wodurch schließlich AMD Assembler 64 Code aus der Eingabe generiert werden konnte. Das Endergebnis ist ein Programm - ein Compiler - der Programme lesen und in Assembler-Code übersetzen kann.",
    "date": "2022",
    "keywords": [
      {
        "tag": "C"
      },
      {
        "tag": "Flex"
      },
      {
        "tag": "Yacc/Bison"
      },
      {
        "tag": "Ox"
      },
      {
        "tag": "iBurg"
      },
      {
        "tag": "University"
      },
      {
        "tag": "Top"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/CompilerConstruction"
  },
  {
    "title": "Visual Computing",
    "description_en": "This repository contains assignments that should be developed in the course Introduction to Visual Computing at the Vienna University of Technology. Most of the tasks are written in Matlab and cover Topics of visual computing. The other part of the tasks are modelings that were created with Blender.",
    "description_de": "This repository contains assignments that should be developed in the course Introduction to Visual Computing at the Vienna University of Technology. Most of the tasks are written in Matlab and cover Topics of visual computing. The other part of the tasks are modelings that were created with Blender.",
    "date": "2022",
    "keywords": [
      {
        "tag": "Blender"
      },
      {
        "tag": "Matlab"
      },
      {
        "tag": "Visualization"
      },
      {
        "tag": "University"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/VisualComputing"
  },
  {
    "title": "Parallel Computing",
    "description_en": "",
    "description_de": "",
    "date": "2022",
    "keywords": [
      {
        "tag": "OpenMP"
      },
      {
        "tag": "MPI"
      },
      {
        "tag": "University"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/ParallelComputing"
  },
  {
    "title": "Statistical Computing With R",
    "description_en": "This repository contains exercises that were required in the course Statistical Computing in R at the Vienna University of Technology. In total, four examples were worked on, all of which were developed using the programming language R.",
    "description_de": "This repository contains exercises that were required in the course Statistical Computing in R at the Vienna University of Technology. In total, four examples were worked on, all of which were developed using the programming language R.",
    "date": "2022",
    "keywords": [
      {
        "tag": "R Studio"
      },
      {
        "tag": "Statistic"
      },
      {
        "tag": "University"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/StatisticalComputingR"
  },
  {
    "title": "Operating System Development",
    "description_en": "This repository contains my first higher half kernel.",
    "description_de": "This repository contains my first higher half kernel.",
    "date": "2022",
    "keywords": [
      {
        "tag": "Limine"
      },
      {
        "tag": "Stivale"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/OperatingSystemDevelopment"
  },
  {
    "title": "Object Oriented Programming With Java",
    "description_en": "This repository contains tasks that had to be completed as a team in the Object Oriented Programming course at the Vienna University of Technology.",
    "description_de": "This repository contains tasks that had to be completed as a team in the Object Oriented Programming course at the Vienna University of Technology.",
    "date": "2021",
    "keywords": [
      {
        "tag": "Java"
      },
      {
        "tag": "OOP"
      },
      {
        "tag": "Paradigma"
      },
      {
        "tag": "University"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/ObjectOrientedProgrammingJava"
  },
  {
    "title": "Introduction to Security",
    "description_en": "This repository contains tasks that were completed in the Introduction to Security course at the Vienna University of Technology.",
    "description_de": "This repository contains tasks that were completed in the Introduction to Security course at the Vienna University of Technology.",
    "date": "2020",
    "keywords": [
      {
        "tag": "Security"
      },
      {
        "tag": "Challenges"
      },
      {
        "tag": "Hacking"
      },
      {
        "tag": "University"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/IntroductionToSecurity"
  },
  {
    "title": "Web Engineering",
    "description_en": "This repository contains assignments to be completed in the course of the Web Engineering course at the Vienna University of Technology. The first example deals with web page design using CSS. In the second example plain JavaScript was used. In the third example the backend of a web application was written with Node.js. In the last example the frontend of the web application was developed with Vue.js.",
    "description_de": "This repository contains assignments to be completed in the course of the Web Engineering course at the Vienna University of Technology. The first example deals with web page design using CSS. In the second example plain JavaScript was used. In the third example the backend of a web application was written with Node.js. In the last example the frontend of the web application was developed with Vue.js.",
    "date": "2020",
    "keywords": [
      {
        "tag": "CSS"
      },
      {
        "tag": "JavaScript"
      },
      {
        "tag": "Vue.js"
      },
      {
        "tag": "University"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/WebEngineering"
  },
  {
    "title": "Semi-Structured Data",
    "description_en": "",
    "description_de": "",
    "date": "2020",
    "keywords": [
      {
        "tag": "XML"
      },
      {
        "tag": "DTD"
      },
      {
        "tag": "XSD"
      },
      {
        "tag": "XPD"
      },
      {
        "tag": "University"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/SemiStructuredData"
  },
  {
    "title": "Data Analysis With R",
    "description_en": "",
    "description_de": "",
    "date": "2019",
    "keywords": [
      {
        "tag": "R Studio"
      },
      {
        "tag": "Statistics"
      },
      {
        "tag": "University"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/DataAnalysisR"
  },
  {
    "title": "Introduction to Programming With Java",
    "description_en": "This repository contains some assignments that should be developed for the course Introduction to Programming I and II in the Java programming language.",
    "description_de": "This repository contains some assignments that should be developed for the course Introduction to Programming I and II in the Java programming language.",
    "date": "2019",
    "keywords": [
      {
        "tag": "Java"
      },
      {
        "tag": "Datastructures"
      },
      {
        "tag": "University"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/JavaIntroductionProgramming"
  },
  {
    "title": "Distributed Systems In Java",
    "description_en": "This repository contains the exercises that we had to complete as a team to finish the distributed systems course at the Vienna University of Technology. Both exercises are written in Java and retain concepts such as threads, synchronization and parallelization.",
    "description_de": "This repository contains the exercises that we had to complete as a team to finish the distributed systems course at the Vienna University of Technology. Both exercises are written in Java and retain concepts such as threads, synchronization and parallelization.",
    "date": "2019",
    "keywords": [
      {
        "tag": "Java"
      },
      {
        "tag": "Threads"
      },
      {
        "tag": "Synchronization"
      },
      {
        "tag": "University"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/DistributedSystems"
  },
  {
    "title": "Smart Driving - Driving Log Application",
    "description_en": "Smart Driving is the first iOS app I wrote with Swift and Firebase. The goal of the application was to automatically read position data from a car's GPS device and automatically create a driving log for corporate clients. Unfortunately the application could not be used in practice according to Austrian law.",
    "description_de": "Smart Driving is the first iOS app I wrote with Swift and Firebase. The goal of the application was to automatically read position data from a car's GPS device and automatically create a driving log for corporate clients. Unfortunately the application could not be used in practice according to Austrian law.",
    "date": "2018",
    "keywords": [
      {
        "tag": "iOS"
      },
      {
        "tag": "Apple"
      },
      {
        "tag": "FireBase"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/SmartDriving"
  },
  {
    "title": "LinkHype - Hyperlink Management",
    "description_en": "LinkHype is a website we developed as a team at the Rennweg Higher Technical School. The website is written in PHP and Javascript and is the first major website with functionality that my team and I have developed. The goal of the website is to store and manage hyperlinks.",
    "description_de": "LinkHype is a website we developed as a team at the Rennweg Higher Technical School. The website is written in PHP and Javascript and is the first major website with functionality that my team and I have developed. The goal of the website is to store and manage hyperlinks.",
    "date": "2013",
    "keywords": [
      {
        "tag": "PHP"
      },
      {
        "tag": "JavaScript"
      },
      {
        "tag": "HTML"
      },
      {
        "tag": "CSS"
      },
      {
        "tag": "First Website"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/LinkHypeHyperlinkManagement"
  },
  {
    "title": "Functional Programming in Haskell",
    "description_en": "This repository contains some assignments that had to be developed in the scope of the Functional Programming course at the Vienna University of Technology. The tasks are written in the programming language Haskell.",
    "description_de": "This repository contains some assignments that had to be developed in the scope of the Functional Programming course at the Vienna University of Technology. The tasks are written in the programming language Haskell.",
    "date": "2022",
    "keywords": [
      {
        "tag": "Haskell"
      },
      {
        "tag": "Side Effects"
      },
      {
        "tag": "Functions"
      },
      {
        "tag": "University"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/FunctionalProgrammingHaskell"
  },
  {
    "title": "Ticketline",
    "description_en": "This project was carried out in the course of the software development and project management course at the Vienna University of Technology. The main goal was to plan and execute a small software project in a team of six people. The software to be developed was a web-based ticket store. The user should be able to buy, cancel and manage tickets. The frontend of the application was developed with the framework Angular from Google. The backend is written in Java and is based on the framework Spring Boot.",
    "description_de": "Dieses Projekt wurde im Rahmen des Kurses für Softwareentwicklung und Projektmanagement an der Technischen Universität Wien durchgeführt. Das Hauptziel war die Planung und Durchführung eines kleinen Softwareprojekts in einem Team von sechs Personen. Die zu entwickelnde Software war ein webbasierter Ticketshop. Der Benutzer sollte die Möglichkeit haben, Tickets zu kaufen, zu stornieren und zu verwalten. Das Frontend der Anwendung wurde mit dem Framework Angular von Google entwickelt. Das Backend ist in Java geschrieben und basiert auf dem Framework Spring Boot.",
    "date": "2021",
    "keywords": [
      {
        "tag": "Java Spring Boot"
      },
      {
        "tag": "Angular"
      },
      {
        "tag": "Project Management"
      },
      {
        "tag": "University"
      },
      {
        "tag": "Top"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/SoftwareEngineeringProjektmanagement"
  },
  {
    "title": "Compiler Construction LLVM",
    "description_en": "This project contains my implementation of the Kaleidoscope exercise programming language from an LLVM tutorial. The goal of the project was to experience other approaches to developing a compiler besides the tools Flex, YACC, OX and iBurg. Basically the developed compiler sticks very much to the code presented in the tutorials, but here and there I used other approaches and adapted the language according to my ideas. Furthermore I extended the tutorial by a test system, with which I can validate many test inputs automatically. The used programming language is C++ and most of the used functions are from the LLVM project.",
    "description_de": "Dieses Projekt enthält meine Implementierung der Übungsprogrammiersprache Kaleidoscope aus einem LLVM-Tutorial. Ziel des Projekts war es, neben den Tools Flex, YACC, OX und iBurg weitere Ansätze zur Entwicklung eines Compilers auszuprobieren. Grundsätzlich hält sich der entwickelte Compiler sehr stark an den in den Tutorials vorgestellten Code, aber hier und da habe ich andere Ansätze verwendet und die Sprache nach meinen Vorstellungen angepasst. Außerdem habe ich das Tutorial um ein Testsystem erweitert, mit dem ich viele Testeingaben automatisch validieren kann. Die verwendete Programmiersprache ist C++ und die meisten der verwendeten Funktionen stammen aus dem LLVM-Projekt.",
    "date": "2022",
    "keywords": [
      {
        "tag": "C++"
      },
      {
        "tag": "LLVM"
      },
      {
        "tag": "Top"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/CompilerConstructionLLVM"
  },
  {
    "title": "System Near Programming With C",
    "description_en": "This repository contains exercises that had to be developed in the course Operating Systems at the Vienna University of Technology.",
    "description_de": "This repository contains exercises that had to be developed in the course Operating Systems at the Vienna University of Technology.",
    "date": "2021",
    "keywords": [
      {
        "tag": "C"
      },
      {
        "tag": "Operating Systems"
      },
      {
        "tag": "Files"
      },
      {
        "tag": "University"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/OperatingSystems"
  },
  {
    "title": "Vacayournal",
    "description_en": "In the course of this private project I developed a clone of Instagram and Facebook. The goal of the project was to develop a platform independent of Facebook, where pictures and posts can be shared with friends. The user can create an account, manage it and write textual posts as usual on Facebook, as well as share pictures and galleries as usual for Instagram. The name of the application is composed of the words Vacaytion and Journal and should thus give the possibility to document travels. For the development only the programming languages PHP and JavaScript were used, so I wanted to deepen my education in web development and website design. Furthermore, I could see how many advantages a powerful frontend framework offers to keep the code structured and to use predefined functions.",
    "description_de": "Im Rahmen dieses privaten Projekts habe ich einen Klon von Instagram und Facebook entwickelt. Ziel des Projekts war es, eine von Facebook unabhängige Plattform zu entwickeln, auf der Bilder und Posts mit Freunden geteilt werden können. Der Nutzer kann ein Konto anlegen, verwalten und wie bei Facebook üblich Textbeiträge schreiben, sowie wie bei Instagram üblich Bilder und Galerien teilen. Der Name der Anwendung setzt sich aus den Wörtern Vacaytion und Journal zusammen und soll somit die Möglichkeit geben, Reisen zu dokumentieren. Für die Entwicklung kamen ausschließlich die Programmiersprachen PHP und JavaScript zum Einsatz, wodurch ich meine Ausbildung in der Webentwicklung und im Website-Design vertiefen wollte. Außerdem konnte ich sehen, wie viele Vorteile ein mächtiges Frontend-Framework bietet, um den Code strukturiert zu halten und vordefinierte Funktionen zu nutzen.",
    "date": "2019",
    "keywords": [
      {
        "tag": "PHP"
      },
      {
        "tag": "HTML"
      },
      {
        "tag": "CSS"
      },
      {
        "tag": "JavaScript"
      },
      {
        "tag": "Website"
      },
      {
        "tag": "Top"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/Vacayournal"
  },
  {
    "title": "Voller Freude Website",
    "description_en": "This repository contains a website I wrote for a friend who started a music label in Vienna.",
    "description_de": "This repository contains a website I wrote for a friend who started a music label in Vienna.",
    "date": "2014",
    "keywords": [
      {
        "tag": "HTML"
      },
      {
        "tag": "CSS"
      },
      {
        "tag": "Webdesign"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/VollerFreudeWebsite"
  },
  {
    "title": "E-Learning Video Platform",
    "description_en": "This repository contains an e-learning platform that we wrote as a team for the e-learning course at the Rennweg higher technical school. The user can create an account and answer questions about different historical events.",
    "description_de": "This repository contains an e-learning platform that we wrote as a team for the e-learning course at the Rennweg higher technical school. The user can create an account and answer questions about different historical events.",
    "date": "2019",
    "keywords": [
      {
        "tag": "PHP"
      },
      {
        "tag": "HTML"
      },
      {
        "tag": "CSS"
      },
      {
        "tag": "JavaScript"
      },
      {
        "tag": "School"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/E-LearningVideoPlatform"
  },
  {
    "title": "Hagnnet Website",
    "description_en": "This repository contains a single page website that we used years ago for our home network.",
    "description_de": "This repository contains a single page website that we used years ago for our home network.",
    "date": "2015",
    "keywords": [
      {
        "tag": "HTML"
      },
      {
        "tag": "CSS"
      },
      {
        "tag": "Webdesign"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/HagnnetWebsite"
  },
  {
    "title": "Angular And Laravel Projects",
    "description_en": "In this project I have summarized all the tasks and exercises I had to do during the software development course at the higher technical institute Rennweg. Furthermore there are also extracurricular exercises for the final exam. The websites are all written with the frontend framework Angular from Google, whereas the backend is written with the PHP framework Laravel. In most exercises there is a database from which data must be read, stored, edited and deleted. This data is prepared by a REST API and can be requested through HTTP requests from the frontend.",
    "description_de": "In diesem Projekt habe ich alle Aufgaben und Übungen, die ich während des Softwareentwicklungskurses an der Höheren Technischen Lehranstalt Rennweg bearbeiten durfte, zusammengefasst. Außerdem gibt es auch außerschulische Übungen für die Abschlussprüfung. Die Webseiten sind alle mit dem Frontend-Framework Angular von Google geschrieben, während das Backend mit dem PHP-Framework Laravel geschrieben ist. In den meisten Übungen gibt es eine Datenbank, aus der Daten gelesen, gespeichert, bearbeitet und gelöscht werden müssen. Diese Daten werden über eine REST-API aufbereitet und können über HTTP-Anfragen vom Frontend aus angefordert werden.\n\nÜbersetzt mit www.DeepL.com/Translator (kostenlose Version)",
    "date": "2017",
    "keywords": [
      {
        "tag": "Angular"
      },
      {
        "tag": "Laravel"
      },
      {
        "tag": "School"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/AngularLaravelProjects"
  },
  {
    "title": "Personal Websites Archive",
    "description_en": "In this project are former portfolio websites of mine, which are no longer in use or never were in use. With these websites I wanted to improve my skills in web development and website design. Basically these websites are written with HTML and CSS only, but some of them also use the frontend framework Angular from Google.",
    "description_de": "Bei diesem Projekt handelt es sich um frühere Portfolio-Websites von mir, die nicht mehr in Gebrauch sind oder nie in Gebrauch waren. Mit diesen Websites wollte ich meine Fähigkeiten in der Webentwicklung und im Website-Design verbessern. Grundsätzlich sind diese Websites nur mit HTML und CSS geschrieben, aber einige von ihnen verwenden auch das Frontend-Framework Angular von Google.",
    "date": "2015",
    "keywords": [
      {
        "tag": "HTML"
      },
      {
        "tag": "CSS"
      },
      {
        "tag": "Angular"
      },
      {
        "tag": "Laravel"
      },
      {
        "tag": "JavaSCript"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/PersonalWebsitesArchive"
  },
  {
    "title": "Regions Of Interest Profiler C++",
    "description_en": "This project contains the final product of my bachelor thesis <em>\"Detecting Performance Bottlenecks Through AST Transformations\"</em>. The developed tool transforms <em>C++</em> and inserts performance counters dynamically into the source code. This gives the user the possibility to examine a given program step by step for performance bottlenecks. In each profiling step, each level is examined and the user is provided with statistics about the performance of the program. From the information gained, the next step can be started by selecting a critical region. The program is written in <em>C++</em> and is based on the possibility to create tools with the help of the compiler frontend <em>Clang</em>. More information about my bachelor thesis can be found in the section <em>\"Publications\"</em>.",
    "description_de": "Dieses Projekt enthält das Endprodukt meiner Bachelorarbeit <em>\"Erkennen von Leistungsengpässen mittels AST-Transformationen\"</em>. Das entwickelte Tool transformiert <em>C++</em> und fügt Leistungszähler dynamisch in den Quellcode ein. Dies gibt dem Benutzer die Möglichkeit, ein gegebenes Programm Schritt für Schritt auf Leistungsengpässe zu untersuchen. In jedem Profiling-Schritt wird jede Ebene untersucht und der Benutzer erhält Statistiken über die Leistung des Programms. Anhand der gewonnenen Informationen kann der nächste Schritt durch Auswahl einer kritischen Region eingeleitet werden. Das Programm ist in <em>C++</em> geschrieben und basiert auf der Möglichkeit, Tools mit Hilfe des Compiler-Frontends Clang zu erstellen. Weitere Informationen zu meiner Bachelorarbeit finden Sie unter der Rubrik <em>\"Publikationen\"</em>.",
    "date": "2022",
    "keywords": [
      {
        "tag": "Clang"
      },
      {
        "tag": "LLVM"
      },
      {
        "tag": "HPC"
      },
      {
        "tag": "Top"
      }
    ],
    "website": "",
    "github": "https://github.com/maxhagn/ROIProfilerCPP"
  },
  {
    "title": "Computer Now",
    "description_en": "In this project you can find the website of my former one-man business, which I ran for some time besides the university to accept orders in the field of computer support and hardware sales. The website presents the company on the web by showing offered services. Furthermore, the site has a simple configurator that calculates an approximate price for a computer according to the user's needs. The functions of the website are written in PHP. ",
    "description_de": "In diesem Projekt finden Sie die Website meines ehemaligen Einzelunternehmens, das ich einige Zeit neben der Universität betrieben habe, um Aufträge im Bereich Computersupport und Hardwareverkauf anzunehmen. Die Website stellt das Unternehmen im Web vor, indem die angebotenen Dienstleistungen aufgezeigt werden. Außerdem verfügt die Seite über einen einfachen Produktkonfigurator, der einen ungefähren Preis für einen Computer nach den Bedürfnissen des Benutzers berechnet. Die Funktionen der Website sind in PHP geschrieben. ",
    "date": "2020",
    "keywords": [
      {
        "tag": "HTML"
      },
      {
        "tag": "CSS"
      },
      {
        "tag": "PHP"
      },
      {
        "tag": "Top"
      }
    ],
    "website": "https://computer-now.hagn.network",
    "github": ""
  }
]
