{
  "NAVBAR": {
    "HOME": "Home",
    "PUBLICATIONS": "Publications",
    "PROJECTS": "Projects",
    "CV": "CV",
    "CONTACT": "Contact"
  },
  "ABOUT": {
    "PICTURE_ALT": "Picture of the Creator, Maximilian Hagn",
    "HELLO": "Hello World",
    "MAX": "I'm Max",
    "SHORT_DESC": "I am studying and working in the area of computer science and business administration.",
    "LONG_DESC": "At the age of 14 I started to get involved with computer science and software development by moving to a technical high school. After graduating from this five year institution I already had a profound knowledge in this area and thus changed to a technical university to study first Business Informatics and later additionally Software and Information Engineering. Besides some internships in this field I worked for a computer company for three years and worked there in technical support and also developed a small website. Afterwards I changed to another company for which I am currently developing a productivity software."
  },
  "PROJECTS": {
    "HEADING": "Projects",
    "INTRO_TEXT": "In this section you can find my previous software development projects. These projects are either tasks I had to do at school and university or private projects. For most of the projects the source code can be accessed, viewed and reused via GitHub. If projects are still actively hosted on my server, the website of the project is also listed. In the following you see a selection of my best projects, however, another tag can be selected via the dropdown menu.",
    "WEBSITE": "Explore the Website",
    "SOURCE": "View the Source Code",
    "TOOLTIP_SEARCH": "Search for Tag"
  },
  "PUBLICATIONS": {
    "HEADING": "Publications",
    "INTRO_TEXT": "In my school and academic career I was already allowed to write some pre-scientific and scientific work, with which I could deepen my knowledge in the field of computer science. I wrote my most recent thesis in winter 2021 and as part of my bachelor thesis I developed an application that uses the abstract syntax tree provided by Clang and LLVM to analyze C++ programs and automatically insert performance counters at the critical regions of interest. My first pre-scientific work I developed in the course of my diploma thesis, a work that is required to obtain the title of Engineer in Austria. In this work we developed in a team of 5 people an E-Learning Platform based on a self-developed didactic concept. This platform should help young developers to dive faster into the world of web development. Furthermore, we have also developed many other concepts such as the creation of our own CSS framework, which is similar to the established frameworks \"Bootstrap\" or \"Tailwind\". Additional goals of the project included efficient project management and planning, as well as the creation of a marketing concept and our own brand. The abstracts of the papers and links to the websites such as the source code are provided below.",
    "BACHELOR": "Bachelor Thesis",
    "MASTER": "Master Thesis",
    "DIPLOMA": "Diploma Project",
    "UNIVERSITY": "Technical University of Vienna",
    "SCHOOL": "Rennweg Higher Technical School",
    "BOOK": "Download the Book",
    "WEBSITE": "Explore the Website",
    "SOURCE": "View the Source Code",
    "WEBSITE_INFO": "Information Website",
    "WEBSITE_FRAMEWORK": "CSS Framework",
    "WEBSITE_E_LEARNING": "E-Learning Platform",
    "BACHELOR_1_TITLE": "Detecting Performance Bottlenecks through AST Transformations",
    "BACHELOR_1_TEXT_1": "When developing software, many programmers are sooner or later faced with the question of how they can optimize their applications and also keep the runtime as short as possible. Especially in the field of <em>high-performance computing</em> and in the development of time-critical software, shortening the runtime of programs is indispensable. Runtime analysis is therefore a fundamental technique that must be mastered by every developer. For this purpose, the source code is either checked manually or the application is analyzed during runtime using profiling tools. These instruments offer the possibility to obtain data about the performance of single functions for the user. In most tools, <em>Regions of Interest (ROI)</em> can usually be specified manually. Identifying these can be problematic, especially when developing complex programs. Thus, it would be preferable if a method existed with which user-defined <em>Regions of Interest</em> could be analyzed by automatically inserting measurement code.",
    "BACHELOR_1_TEXT_2": "This thesis presents a performance measurement tool that can be used to automatically measure the runtimes of critical areas in <em>C</em>/<em>C++</em> applications. The developed tool is based on the compiler front-end <em>Clang</em>, which offers various functions for traversing <em>Abstract Syntax Trees (AST)</em>. The tool analyzes the <em>Abstract Syntax Tree</em> of the input code provided by <em>Clang</em> and automatically inserts measurement code at the desired positions. For this purpose, the <em>Abstract Syntax Tree</em> is traversed from the root downwards and in each iteration a hierarchically lower level can be selected by the user. In each iteration, the user receives statistics about the <em>Regions of Interests</em> and can decide which area to analyze next based on the information obtained. To demonstrate the functionality of the program we will show the workflow on different examples. Furthermore, an overflow analysis will be carried out to show that the overflow of the profiling process can be minimized by using an iterative approach.",
    "DIPLOMA_TITLE": "Creative Puzzle - Web Development E-Learning Platform",
    "DIPLOMA_TEXT_1": "<em>Creative Puzzle</em> wants to encourage people with little prior knowledge to write web pages and provides assistance through playful exercises, ready-made learning templates and a code library. Learning by doing gives learners the opportunity to quickly familiarize themselves with various programming languages. An E-Learning platform especially for the 1st - 3rd classes of HTLs should be created. Most of the time, lower-level students find it difficult to identify the context of individual components of a documentary, and they find it difficult to manage with the many different commands. <em>Creative Puzzle</em> aims to facilitate the endless browsing of specifications by providing practice-related examples. These can be pre-made templates or playful exercises. In contrast to existing specified information websites, the commands are not explained individually, but web components are explained step by step and therefore presented in a practical way. So the relationship can be understood more easily.",
    "DIPLOMA_TEXT_2": "<em>Creative Puzzle</em> provides a sleek and simple framework and, above all, well-documented documentation. Several stylesheets with many predesigned templates will be available on the website. It also includes graphic elements to playfully learn web programming. Since the team from their own experience in the first HTL years could muster little motivation for the design of websites, one of the goals is to show the topicality of these techniques with a graphically appealing design. Additional the team has worked extensively with several other areas relevant to web development. On the one hand, concepts for the efficient host- ing of a website were designed, on the other hand Creative Puzzle would like to optimize its website according to the Search Engine Optimization guidelines. Another aim will be to enthuse young people for web programming. The project team is mainly concerned with the layout and design of website elements and with the specification. Furthermore, the team will present insights and issues that had to be learned, as well as tips that are relevant for writing a frame-work and for layouting a website. An additional goal is to promote the project and to draw attention to the result through innovative and complex designs of the advertising materials, such as posters, flyers, folders, business cards and cover pictures."
  },
  "CV": {
    "HEADING": "Curriculum Vitae",
    "TOOLTIP_MAIL": "Contact Me Via E-Mail",
    "TOOLTIP_PHONE": "Request Phone Number",
    "TOOLTIP_ADDRESS": "Request Address",
    "PERSONAL": "Personal Data",
    "EDUCATION": "Education",
    "EMPLOYMENT": "Employment History",
    "RECOGNITIONS": "Awards And Recognitions",
    "LANGUAGES": "Languages",
    "SKILLS_HEADING": "Skills",
    "TELEPHONE": "Request phone number",
    "ADDRESS": "Request address",
    "BIRTHDAY": "Birthday: August 25, 1997",
    "BIRTHPLACE": "Birthplace: Dresden, Germany",
    "CITIZENSHIP": "Citizenship: German",
    "RESIDENCE": "Place of Residence: Vienna, Austria",
    "UNIVERSITY": "Technical University of Vienna",
    "BUSINESS_INFORMATICS": "Field of study Business Informatics",
    "SOFTWARE_ENGINEERING": "Field of study Software & Information Engineering",
    "SCHOOL": "Secondary Technical School, 1030 Vienna",
    "MEDIA_TECHNOLOGY": "Focus on media technology",
    "MIDDLE_SCHOOL": "Saint Ursula Middle School, 1230 Vienna",
    "ELEMENTARY_SCHOOL": "Elementary School, Maurer Lange Gasse, 1230 Wien",
    "PRESENT": "Present",
    "AQILO_DESC": "Technical Employee, part-time (20 hours per week)",
    "AVALON_DESC_PT": "Software Developer, Part-Time (11 hours per week)",
    "AVALON": "Avalon Computer System GmbH",
    "SGEF_DESC_FP": "Accountant, Summer Internship (38.5 hours per week)",
    "SGEF_DESC_NJ": "Accountant, Part-Time (10 hours per week)",
    "STIWA_DESC": "Software Developer, Summer Internship (38.5 hours per week)",
    "AVALON_DESC_FP": "Software Developer, Summer Internship (38.5 hours per week)",
    "LEADER_DIPLOMA": "Project Leader of the Diploma Thesis \"Creative Puzzle - Web Development E-Learning Platform\" (Grade: A)",
    "PROJECT_CERTIFICATION": "Project Management Certification (IPMA, jZpm)",
    "TEAM_BUILDING": "Communication, and team building seminar (34 hours)",
    "SIECAMS_LEADER": "Project Leader of an information technology project (product flyer for the service \"Siecams\" of Siemens AG) in the context of the project management course",
    "BSC_1": "Award of the academic degree BSc (Detecting Performance Bottlenecks through AST Transformations)",
    "HEAD_BOY": "Vice departmental representative and 3rd on the school community committee (3rd vice head boy)",
    "LEADER_PROJECT": "Project Leader of an information technology project within the scope of project management course",
    "HIGH_SCHOOL_REP": "High School Class Representative",
    "GERMAN": "German (Native)",
    "ENGLISH": "English (First Modern Foreign Language)"
  },
  "SKILLS": {
    "WORD_PROCESSORS": "Word Processor Programs (Microsoft Word, Pages, Google Docs, LibreOffice Writer)",
    "SPREADSHEET": "Spreadsheet Programs (Microsoft Excel, Numbers, Google Tabellen, LibreOffice Calc)",
    "PRESENTATION": "Presentation Programs (Microsoft PowerPoint, Keynote)",
    "E_MAIL_PROGRAMS": "E-Mail Programs (Microsoft Outlook, Thunderbird)",
    "OPERATING_SYSTEMS": "Operating Systems (Linux, macOS, Windows)",
    "FRONT_END_DEVELOPMENT": "Front-End Development (HTML, CSS)",
    "BACK_END_DEVELOPMENT": "Back-End Development (PHP / Laravel, JAVA / Spring Boot, C# / Blazor, Typescript / Angular, JavaScript)",
    "GENERAL_PURPOSE": "General Purpose Languages (C, C++, Perl, Java)",
    "APPLE_APPS": "Apple Applications (Xcode 9.0, Swift)",
    "NETWORK_ENGINEERING": "Network Engineering",
    "NATIVE_APPS": "Native Applications (Cordova, Electron)",
    "COMPILERS": "Compiler Construction (Lex / Flex, YACC / Bison, Ox, Burg / iBurg, LLVM, Clang)",
    "PROJECT_MANAGEMENT": "Project Management (Linear Models, Agile Methods, IPMA)",
    "ORGANIZATIONAL": "Organizational Talent",
    "RESPONSIBILITY": "Responsibility",
    "TEAM_SPIRIT": "Team Spirit",
    "COMMUNICATION": "Communication Skills",
    "DETERMINATION": "Determination",
    "LICENSES": "B and AM driving license, motorboat driving license"
  },
  "CONTACT": {
    "HEADING": "Contact",
    "INTRO_TEXT": "Feel free to send me an email if you have any questions about me or my projects. However, I am also always interested in freelance opportunities.",
    "TOOLTIP_MAIL": "Contact Me Via E-Mail",
    "TOOLTIP_PHONE": "Request Phone Number"
  }
}
